Reports/ЖурналТрансфузий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ЖурналТрансфузий</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ЭлектронныеПодписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЭлектронныеПодписи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Comment>Версия набора ключевых реквизитов для подписания</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПроверкиПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайлаПодписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомуВыданСертификат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отпечаток</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>28</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписьВерна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СертификатДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибкиПроверкиПодписи</Name>
					<Comment>Заполнено только в том случае, если подпись неверна</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибкиПроверкиСертификата</Name>
					<Comment>Заполнено только в том случае, если сертификат недействителен</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УстановившийПодпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписанФайлЭМД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Подписанный объект</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодписанныйОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодписанныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодписанныйОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ЖурналТрансфузий/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

Функция СформироватьОтчет(ИзменяемыйТабличныйДокумент = Неопределено, Клиент, МедицинскаяКарта, ПустойДокумент=Ложь) Экспорт
	
	Если ИзменяемыйТабличныйДокумент = Неопределено Тогда
		ТабличныйДокумент = Новый ТабличныйДокумент;
	Иначе
		ТабличныйДокумент = ИзменяемыйТабличныйДокумент;
	КонецЕсли;
		
	ТабличныйДокумент.Очистить();	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Макет = ЭтотОбъект.ПолучитьМакет("ЖурналТрансфузий003у");
	
	ВидМД = Новый Массив;
	// ВидМД.Добавить(ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(246, "ВидыМедицинскихДокументов")); // Лист трансфузий
	ВидМД.Добавить(ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(11, "ВидыМедицинскихДокументов"));	  // Протокол трансфузии
	СоответсвиеДанныхКодировки = СоответсвиеДанныхКодировкиТрансфузий();
	
	Выборка = Стационар.ПолучитьВыборкуЗначенийПараметровПоВидуИЗначПараметров(МедицинскаяКарта, ВидМД, СоответсвиеДанныхКодировки);
	
	
	ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапки.Параметры.ФИО = CRMСервер.ПолучитьФИООбъекта(Клиент);
	ОбластьШапки.Параметры.ДатаРождения = Формат(ОбщегоНазначения.ПолучитьЗначениеРеквизита(Клиент, "ДатаРождения"), "ДФ='dd MMMM yyyy'");
	ОбластьШапки.Параметры.НомерМедицинскойКарты = Строка(МедицинскаяКарта);
	Палата = Стационар.ПолучитьПалатыКлиентаПоМедкарте(МедицинскаяКарта, Истина);
	НомерПалаты = ?(ЗначениеЗаполнено(Палата), Палата, "_____");
	ОбластьШапки.Параметры.НомерПалаты = НомерПалаты;
	ТабличныйДокумент.Вывести(ОбластьШапки);
	
	Если Выборка = Неопределено Тогда
		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		Возврат ТабличныйДокумент;
	КонецЕсли;

	
	Пока Выборка.Следующий() Цикл
		ДетальныеЗаписи = Выборка.Выбрать();
		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
		Пока ДетальныеЗаписи.Следующий() Цикл
			ИмяПараметра = СоответсвиеДанныхКодировки.Получить(ДетальныеЗаписи.Назначение);
			Если ИмяПараметра = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если ИмяПараметра = "ДатаПроведения" Тогда
				ОбластьСтрока.Параметры[ИмяПараметра] = Формат(ДетальныеЗаписи.Значение, "ДФ=dd.MM.yyyy");
			ИначеЕсли ИмяПараметра = "Литр" Тогда
				ОбластьСтрока.Параметры[ИмяПараметра] = Формат(ДетальныеЗаписи.Значение, "ЧГ=");
			ИначеЕсли ИмяПараметра = "Единица" Тогда
				ОбластьСтрока.Параметры[ИмяПараметра] = ПолучитьКраткоеПредставлениеЕдиницы(ДетальныеЗаписи.Значение);
			Иначе
				ОбластьСтрока.Параметры[ИмяПараметра] = ДетальныеЗаписи.Значение;
			КонецЕсли;
		КонецЦикла;
		Врач = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Выборка.Документ, "Врач");
		ОбластьСтрока.Параметры.ФИОВрача = CRMСервер.ПолучитьФИООбъекта(Врач);
		ПодставитьПодписи(ОбластьСтрока, Выборка.Документ, Врач); 
		ТабличныйДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	Если ИзменяемыйТабличныйДокумент = Неопределено Тогда
		Возврат ТабличныйДокумент;
	КонецЕсли;
			
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция СоответсвиеДанныхКодировкиТрансфузий()
	
	 Соответствие = Новый Соответствие;
	 Соответствие.Вставить(Перечисления.КодировкаПолейЭМД.КомпонентКрови, "НаименованиеКомпонента");
	 Соответствие.Вставить(ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(8130, "КлассификаторыМинЗдрава",  Перечисления.ВидыКлассификаторовМинЗдрава.КодируемыеПоляCDAДокументов), "Литр");
	 Соответствие.Вставить(Перечисления.КодировкаПолейЭМД.ЕдиницаИзмерения, "Единица");
	 Соответствие.Вставить(ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(4068, "КлассификаторыМинЗдрава",  Перечисления.ВидыКлассификаторовМинЗдрава.КодируемыеПоляCDAДокументов), "ДатаПроведения");
	 Соответствие.Вставить(Перечисления.КодировкаПолейЭМД.Медсестра, "ФИОМедсестры");
	 Соответствие.Вставить(ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(9054, "КлассификаторыМинЗдрава",  Перечисления.ВидыКлассификаторовМинЗдрава.КодируемыеПоляCDAДокументов), "ИмеютсяОсложнения"); 
	 Возврат Соответствие;
	
КонецФункции

Процедура ПодставитьПодписи(Область, Документ, Врач)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭлектронныеПодписи.УстановившийПодпись КАК УстановившийПодпись,
		|	ЭлектронныеПодписи.Сертификат КАК Сертификат,
		|	ЭлектронныеПодписи.ДатаПодписи КАК ДатаПодписи
		|ИЗ
		|	РегистрСведений.ЭлектронныеПодписи КАК ЭлектронныеПодписи
		|ГДЕ
		|	ЭлектронныеПодписи.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДанныеПодписи = ЭЦП_УМЦ_Сервер.ПолучитьДанныеСертификата(Выборка.Сертификат, Документ, Выборка.ДатаПодписи); 
		СтрокаПодписи = СтрШаблон("Сертификат: %1, владелец: %2, действителен с %3 по %4",
									ДанныеПодписи.Сертификат,
									ДанныеПодписи.ВладелецСертификата,
									ДанныеПодписи.ДействительностьСертификатаНачало,
									ДанныеПодписи.ДействительностьСертификатаОкончание);
		Если ОбщегоНазначения.ПолучитьЗначениеРеквизита(Выборка.УстановившийПодпись, "Сотрудник") = Врач Тогда
			Область.Параметры.ПодписьВрача = СтрокаПодписи;
		Иначе
			Область.Параметры.ПодписьМедсестры = СтрокаПодписи;	
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьКраткоеПредставлениеЕдиницы(Единица)
	
	Значение = Единица;
	
	Попытка
		
		Для Каждого Эл Из Единица.Атрибуты Цикл
			Если Эл.Ключ = "SHORTNAME" Тогда
				Значение = Эл.Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
			
	Исключение
	КонецПопытки;
	
	Возврат Значение;
	
	
КонецФункции

#КонецОбласти
